IDEA Open Model
CrossSectionComponentThermalData Class
Compatible with IDEA StatiCa Beta 20.0
 Cross-section component thermal data
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.CrossSection.CrossSectionComponentThermalData
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class CrossSectionComponentThermalData
Public Class CrossSectionComponentThermalData
The CrossSectionComponentThermalData type exposes the following members.
Constructors
Name | Description
CrossSectionComponentThermalData
Initializes a new instance of the CrossSectionComponentThermalData class
Top
Properties
Name | Description
ComponentIndex
 Zero based index of component
MoistureContent
 Moisture content
ThermalConductivityLimit
 Thermal conductivity limit
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace